templates/xml/create_user_session.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <CreateUserSessionFromInstance xmlns="http://archer-tech.com/webservices/">
            <userName>{username}</userName>
            <instanceName>{instance_id}</instanceName>
            <password>{password}</password>
        </CreateUserSessionFromInstance>
    </soap:Body>
</soap:Envelope>
